turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cm32/atdf/ATSAM4CMP32C_1.atdf
        <register caption="Channel Enable Register" name="ADC_CHER" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Disable Register" name="ADC_CHDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Disable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 6 Disable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Disable" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Status Register" name="ADC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Last Converted Data Register" name="ADC_LCDR" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Data Converted" mask="0x00000FFF" name="LDATA"/>
          <bitfield caption="Channel Number" mask="0x0000F000" name="CHNB"/>
        </register>
        <register caption="Interrupt Enable Register" name="ADC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Temperature Change Interrupt Enable" mask="0x00080000" name="TEMPCHG"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Enable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register" name="ADC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Temperature Change Interrupt Disable" mask="0x00080000" name="TEMPCHG"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Disable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Mask Register" name="ADC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Temperature Change Interrupt Mask" mask="0x00080000" name="TEMPCHG"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Mask" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Status Register" name="ADC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="End of Conversion 0 (automatically set/cleared)" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1 (automatically set/cleared)" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2 (automatically set/cleared)" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3 (automatically set/cleared)" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 6 (automatically set/cleared)" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7 (automatically set/cleared)" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Temperature Change (cleared on read)" mask="0x00080000" name="TEMPCHG"/>
          <bitfield caption="Data Ready (automatically set/cleared)" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error (cleared on read)" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event (cleared on read)" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Transfer (automatically set/cleared)" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full (automatically set/cleared)" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Temperature Sensor Mode Register" name="ADC_TEMPMR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Temperature Sensor ON" mask="0x00000001" name="TEMPON"/>
          <bitfield caption="Temperature Comparison Mode" mask="0x00000030" name="TEMPCMPMOD" values="ADC_TEMPMR__TEMPCMPMOD"/>
        </register>
        <register caption="Temperature Compare Window Register" name="ADC_TEMPCWR" offset="0x38" rw="RW" size="4">
          <bitfield caption="Temperature Low Threshold" mask="0x00000FFF" name="TLOWTHRES"/>
          <bitfield caption="Temperature High Threshold" mask="0x0FFF0000" name="THIGHTHRES"/>
        </register>
        <register caption="Overrun Status Register" name="ADC_OVER" offset="0x3C" rw="R" size="4">
          <bitfield caption="Overrun Error 0" mask="0x00000001" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000002" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000004" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000008" name="OVRE3"/>
          <bitfield caption="Overrun Error 6" mask="0x00000040" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00000080" name="OVRE7"/>
        </register>
        <register caption="Extended Mode Register" name="ADC_EMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Comparison Mode" mask="0x00000003" name="CMPMODE" values="ADC_EMR__CMPMODE"/>
          <bitfield caption="Comparison Selected Channel" mask="0x000000F0" name="CMPSEL"/>
          <bitfield caption="Compare All Channels" mask="0x00000200" name="CMPALL"/>
          <bitfield caption="Compare Event Filtering" mask="0x00003000" name="CMPFILTER"/>
          <bitfield caption="Over Sampling Rate" mask="0x00030000" name="OSR" values="ADC_EMR__OSR"/>
          <bitfield caption="Averaging on Single Trigger Event" mask="0x00100000" name="ASTE" values="ADC_EMR__ASTE"/>
          <bitfield caption="TAG of the ADC_LDCR register" mask="0x01000000" name="TAG"/>
        </register>
        <register caption="Compare Window Register" name="ADC_CWR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x00000FFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0x0FFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="Channel Data Register 0" name="ADC_CDR0" offset="0x50" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 1" name="ADC_CDR1" offset="0x54" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 2" name="ADC_CDR2" offset="0x58" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 3" name="ADC_CDR3" offset="0x5C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 4" name="ADC_CDR4" offset="0x60" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
