turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cm32/atdf/ATSAM4CMP32C_1.atdf
      <value-group caption="" name="PIO_DRIVER__LINE10">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE11">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE12">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE13">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE14">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE15">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE16">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE17">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE18">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE19">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE20">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE21">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE22">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE23">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE24">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE25">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE26">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE27">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE28">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE29">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE30">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE31">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
    </module>
    <module caption="Power Management Controller" name="PMC" version="11116S">
      <register-group name="PMC">
        <register caption="System Clock Enable Register" name="PMC_SCER" offset="0x0000" rw="W" size="4">
          <bitfield caption="Programmable Clock 0 Output Enable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Enable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Enable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="Coprocessor (Second Processor) Clocks Enable" mask="0x00010000" name="CPCK"/>
          <bitfield caption="Coprocessor Bus Master Clocks Enable" mask="0x00020000" name="CPBMCK"/>
          <bitfield caption="Coprocessor Clocks Enable Key" mask="0x00F00000" name="CPKEY" values="PMC_SCER__CPKEY"/>
        </register>
        <register caption="System Clock Disable Register" name="PMC_SCDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="Programmable Clock 0 Output Disable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Disable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Disable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="Coprocessor Clocks Disable" mask="0x00010000" name="CPCK"/>
          <bitfield caption="Coprocessor Bus Master Clocks Disable" mask="0x00020000" name="CPBMCK"/>
          <bitfield caption="Coprocessor Clocks Disable Key" mask="0x00F00000" name="CPKEY" values="PMC_SCDR__CPKEY"/>
        </register>
